{"format": "graph-model", "generatedBy": "1.15.2", "convertedBy": "TensorFlow.js Converter v3.13.0", "signature": {"inputs": {"input": {"name": "Reshape_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1960"}]}}}, "outputs": {"output": {"name": "labels_softmax:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "Reshape_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "1960"}]}}}}, {"name": "Reshape_2/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "first_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "8"}, {"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "first_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "final_fc_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "final_fc_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "Reshape_2", "op": "Reshape", "input": ["Reshape_1", "Reshape_2/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["Reshape_2", "first_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "add", "op": "AddV2", "input": ["Conv2D", "first_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape_3", "op": "Reshape", "input": ["Relu", "Reshape_3/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["Reshape_3", "final_fc_weights"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "add_1", "op": "AddV2", "input": ["MatMul", "final_fc_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "labels_softmax", "op": "Softmax", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Reshape_2/shape", "shape": [4], "dtype": "int32"}, {"name": "first_weights", "shape": [10, 8, 1, 8], "dtype": "float32"}, {"name": "first_bias", "shape": [8], "dtype": "float32"}, {"name": "Reshape_3/shape", "shape": [2], "dtype": "int32"}, {"name": "final_fc_weights", "shape": [4000, 6], "dtype": "float32"}, {"name": "final_fc_bias", "shape": [6], "dtype": "float32"}]}]}